Revit 2027 API
GroupTypeId.ViewPositioning Property
 View to Sheet Positioning.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewPositioning { get; }
Public Shared ReadOnly Property ViewPositioning As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewPositioning {
	ForgeTypeId^ get ();
}
static member ViewPositioning : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace